test/dummy/app/controllers/articles_controller.rb

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["title", "Hi"], ["text", "There"], ["updated_at", Thu, 21 Nov 2013 11:08:24 UTC +00:00]]