test/dummy/app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["author", "Me"], ["content", "What is up ?"], ["created_at", Thu, 21 Nov 2013 11:08:24 UTC +00:00], ["updated_at", Thu, 21 Nov 2013 11:08:24 UTC +00:00]]
---
  def create
    @comment = Comment.new(comment_params)

    if @comment.save

UPDATE "comments" SET "author" = ?, "content" = ?, "updated_at" = ? WHERE "comments"."id" = 1  [["author", "You"], ["content", "How are you doing ?"], ["updated_at", Thu, 21 Nov 2013 11:08:25 UTC +00:00]]
---
  def update
    if @comment.update(comment_params)